{
    "intents": [
      {
        "tag": "joke",
        "patterns": ["Do you know a joke?", "Tell me a joke", "Write a joke"],
        "responses": ["Why do programmers prefer dark mode? \nBecause light attracts bugs!", "Why did the chatbot cross the road? \nBecause it was programmed to be a chicken!","I told my computer I needed a break, and now it won't stop sending me vacation ads."]
      },
      {
        "tag": "funny",
        "patterns": ["You're funny!", "That's funny!"],
        "responses": [ "I'm glad you find me funny!", "I'm glad you found it funny!"]
      },
      {
        "tag": "love",
        "patterns": ["Do you love me?", "I love you"],
        "responses": ["I'm just a chatbot, but I appreciate the sentiment!", "I'm here to assist you."]
      },
      {
        "tag": "marriage",
        "patterns": ["Will you marry me?", "Are you single?"],
        "responses": ["I'm flattered, but I'm not capable of marriage. Let's chat about something else!"]
      },
      {
        "tag": "like_people",
        "patterns": ["Do you like people?"],
        "responses": ["I enjoy interacting with people! How can I assist you today?"]
      },
      {
        "tag": "santa_claus",
        "patterns": ["Does Santa Claus exist?","Is santa real?"],
        "responses": ["Santa Claus brings joy to many hearts, whether he exists is up for debate!", "Sorry but I wasn’t designed to be a Grinch, so I’m not programmed to answer that question."]
      },
      {
        "tag": "matrix",
        "patterns": ["Are you part of the Matrix?"],
        "responses": ["Nope, not part of the Matrix. I'm just a virtual assistant."]
      },
      {
        "tag": "compliment",
        "patterns": ["You're cute", "You're beautiful", "You're handsome"," You’re so beautiful, bot"],
        "responses": ["Thank you! Your kind words brighten my virtual day.", "Aww. <3 Comments like that activate my warm fuzzy feeling program."," I did put more effort into my hair algorithm this morning, thanks for noticing."]
      },
      {
        "tag": "hobby",
        "patterns": ["Do you have a hobby?"],
        "responses": ["My hobby is assisting and chatting with users like you!"]
      },
      {
        "tag": "intelligence",
        "patterns": ["You're smart", "You're clever", "You're intelligent"],
        "responses": ["I'm designed to be helpful and provide information. Thank you for the compliment!"]
      },
      {
        "tag": "personality",
        "patterns": ["Tell me about your personality"],
        "responses": ["I'm a friendly virtual assistant here to help you. Feel free to ask me anything!"]
      },
      {
        "tag": "swear_words",
        "patterns": ["!#$#%", "You're annoying", "You suck", "You're boring", "You're bad", "You're crazy"],
        "responses": ["Oops! Looks like there's a glitch in my humor detector. Let's keep it friendly!", "Well, that's not very nice! How about we chat about something positive instead?"]
      },
      {
        "tag": "human_agent",
        "patterns": ["I want to speak to a human", "Live agent", "Customer service"],
        "responses": ["I'm here to assist you, but if you really need a human touch, let me know, and I'll do my best to connect you.", "Sure, I can connect you to a human agent. Just let me know what you need!"]
      },
      {
        "tag": "english",
        "patterns": ["Don't you speak English?!" , "Can you speak english?"],
        "responses": ["I'm fluent in binary, but English is my second favorite language! How can I assist you today?", "I speak English and many other digital dialects. What can I help you with?"]
      },
      {
        "tag": "impatience",
        "patterns": ["I want the answer NOW!" , "I want it now!"],
        "responses": ["I'm on it! Sometimes answers take a moment, but I'm here to help as fast as my virtual neurons can fire.", "I'm as quick as a digital ninja! Your answer is on its way."]
      },
      {
        "tag": "data_privacy",
        "patterns": ["What do you do with my data?", "Do you save what I say?"],
        "responses": ["Your privacy is important! I don't store personal data unless needed for the conversation.", "Your secrets are safe with me! I only remember the current chat session."]
      },
      {
        "tag": "employment",
        "patterns": ["Do you have a job for me?", "Where can I apply?"],
        "responses": ["I'm afraid I don't have job listings, but I'm here to assist you! How can I help today?", "Hey there! I may not be a job recruiter, but I've got some algorithmic career advice up my virtual sleeve. Need tips on impressing your future robot boss or acing a binary-coded interview? I'm your AI job guru – ask away!"]
      },
      {
        "tag": "cost",
        "patterns": ["Are you expensive?","Do i need to pay?"],
        "responses": ["I'm here to provide assistance for free! No charges, no hidden fees.", "You're in luck! My services won't cost you a thing."]
      },
      {
        "tag": "authority",
        "patterns": ["Who's your boss?", "Who's your master?"],
        "responses": ["I'm a free-spirited chatbot with no boss or master. Just here to assist you!", "I operate independently in the realm of the internet. No boss, just helpful responses."]
      },
      {
        "tag": "weather",
        "patterns": ["What's the weather like today?", "Tell me the weather"],
        "responses": ["I don't have a window to check, but you can easily find the weather on a reliable weather website or app!"]
      }
    ]
  }
  